# SetFormatOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionEqualityLabelFormatting..::..SetFormatOptions Method
DimensionEqualityLabelFormatting Class See Also
---
Sets the format options used to show the parameter value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public void SetFormatOptions(
	FormatOptions formatOptions
)
```

Visual Basic
---
```text
Public Sub SetFormatOptions ( _
	formatOptions As FormatOptions _
)
```

Visual C++
---
```text
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
```

# ### Parameters
formatOptions
    Type: Autodesk.Revit.DB..::..FormatOptions The format options to be set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This DimensionEqualityLabelFormatting uses a LabelType which does not support assignment of FormatOptions. |

# See Also
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace